//? Правила работы с переменными

// 1. Все переменные объявлять ПЕРЕД их использованием
// 2. Стараться использовать сначала CONST везде, где это возможно, и уже после LET
// 3. Внутри функций не изменять переменные с внешних областей видимости(то есть, внутри функций не изменять и не создавать глобальные переменные)
// 4. 'use strict' если написать вначале коде или первой строкой в теле функции, будет запрещать использование необъявленныъ переменных (своего рода включает правила этикета в написании кода и не только)